import re

# Dictionaries for normalization of description
n_form_words = {
    'табл': ['табл', 'таб', 'таблетки'],
    'п/плен/оболоч': ['п/о', 'плен', 'плен/оболоч', 'п', 'оболоч', 'п/плен/оболоч', 'п/плен'],
    'внутриматочная': ['вн/маточная', 'внутриматочная'],
    'д/вн/пр': ['д/вн.пр.', 'внутрь', 'д/приема', 'д/пр', 'внут', 'д/внут', 'внутр', 'д/вн', 'д/прием', 'вн'],
    'кишечнораствор': ['киш', 'раст', 'кишечнорастворимые', 'кишечнораствор', 'кишечнорастворим', 'кишеч', 'раств',
                       'киш-раств'],
    'капс': ['капс'],
    'д/наруж': ['д/наруж', 'д/нар', 'наруж', 'применения', 'д/наружного'],
    'д/мест': ['д/мест', 'мест', 'д/местн', 'д/мест/наруж', 'прим', 'примен', 'наруж', 'пр'],
    'аэроз': ['аэроз', 'аэрозоль', 'аэролайзер', 'аэр'],
    'тюб/кап': ['тюб/кап', 'тюб-кап'],
    'д/дет': ['д/дет', 'детский', 'детс', 'д/детей', 'для детей'],
    'конц': ['конц', 'конц-т', 'концентрированный', 'концентрированное', 'концентрат'],
    'масл': ['масл', 'маслян', 'масляный'],
    'для интимной гигиены': ['для интимной гигиены', 'д/инт', 'гигиены'],
    'от выпадения волос': ['от', 'вып', 'вол', 'выпадения', 'волос'],
    'д/инг': ['д/инг', 'д/ингал', 'ингал', 'для', 'инг', 'ингаляций'],
    'д/приг': ['д/пригот', 'д/приг'],
    'д/приг сусп': ['д/сусп', 'пор'],
    'д/приг раствора': ['д/р-ра'],
    'раствора': ['р-ра'],
    'фл/кап': ['флак/кап', 'фл/кап', 'фл-кап'],
    'флакон': ['фл', 'флак', 'флакон'],
    'раствор': ['р-р', 'раствор', 'д/р-р'],
    'пак': ['пак', 'пакет'],
    'инд/уп': ['инд/уп', 'инд', 'уп'],
    'д/рассас': ['д/рассас', 'д/расс'],
    'жев': ['жев', 'жеват'],
    'рект': ['рект', 'ректальные', 'д/рект'],
    'назал': ['назал', 'наз', 'назальный', 'назальн'],
    'глаз': ['гл', 'глаз'],
    'для инъекций': ['для инъекций', 'д/инъек', 'д/инъекц', 'д/ин'],
    'ваг': ['ваг', 'вагин', 'вагинальн', 'д/ваг', 'д/вагин', 'д/вагинальн'],
    'пастилки': ['пастилки', 'паст'],
    'к-та': ['к-та', 'кислота'],
    'ф/п': ['ф/п', 'ф/пак'],
    'п/к': ['п/к', 'д/подкож', 'подкож'],
    'р-ль': ['р-ль', 'раст-ль'],
    'блистер': ['блист', 'блистер'],
    'ополаскиватель': ['ополаскиватель', 'ополаскив'],
    'шприц': ['шприц', 'шпр'],
    'дозир': ['дозир', 'доз'],
    'капли': ['капли'],
    'ушн': ['ушн', 'ушные'],
    'крем': ['крем'],
    'амп': ['амп'],
    'в/м': ['в/м'],
    'в/в': ['в/в'],
    'гель': ['гель'],
    'мазь': ['мазь'],
    'спрей': ['спрей'],
    'туба': ['туба'],
    'сироп': ['сироп'],
    'супп': ['супп'],
    'сусп': ['сусп'],
    'д/инф': ['д/инф'],
    'бальзам': ['бальзам'],
    'шампунь': ['шампунь'],
    'масло': ['масло'],
    'саше': ['саше'],
    'драже': ['драже'],
    'паста': ['паста'],
    'настойка': ['настойка'],
    'банка': ['банка'],
}
n_additional = {'вит': ['вит', 'витамин']}
n_useless = ['для', 'прим', 'и', 'акция', 'от', 'в', 'введ', 'пролонг', 'карт', 'уп', 'яч', 'контур', 'исп', 'озон',
             'в компл', 'пласт', 'распыл', 'высв', 'высвоб', 'терап', 'система']


def group_sub(adding=False):
    def group_sub_function(m):
        global word_found
        global word_sub
        if not word_found:
            word_found = True
            if adding:
                return m.group(1) + word_sub
            else:
                return m.group(1)

    return group_sub_function


def normalize_desc(desc):
    global word_found
    global word_sub
    useless_mask = '([^a-zа-я])(' + '|'.join(n_useless) + ')([\.,]|(?![a-zа-я]))'
    dosage_mask = '(?:дозир)?[. ]?([\d.,/]+)(?: )?(мг/мл|мг|мл|%|ме|г|ед|мкг|часа|час).?'
    desc = desc.lower()

    desc_form = ''

    # Implementing normalization
    for key in n_form_words.keys():
        word_found = False
        word_sub = key
        mask = '(\W)(' + '|'.join(n_form_words[key]) + ')(?=$|[\.,\W])'
        if re.search(mask, desc):
            desc_form += ' ' + key
            desc = re.sub(mask, group_sub(), desc)
    desc_form = desc_form.strip()

    for key in n_additional.keys():
        word_found = False
        word_sub = key
        mask = '([^a-zа-я])(' + '|'.join(n_additional[key]) + ')([\.,]?|(?![a-zа-я]))'
        if re.search(mask, desc):
            desc = re.sub(mask, group_sub(True), desc)

    if re.search(useless_mask, desc):
        desc = re.sub(useless_mask, '', desc)

    amount = '1'
    if re.search('(\D)[хx](\d+)', desc):
        amount = re.search('(?:\D)[хx](\d+)', desc).group(1)
        desc = re.sub('(\D)[хx](\d+)', '', desc)

    dosage = ' '.join([''.join(doze) for doze in re.findall(dosage_mask, desc)])
    desc = re.sub(dosage_mask, '', desc)

    # 'asdf .. sdasd. . ,.  ad ' -> 'asdf sdasd ad'
    desc = re.sub('[.,()+"\']+', '', desc).strip()
    desc = re.sub('\s+', ' ', desc).strip()

    return desc, desc_form, amount, dosage
